jacob-jarick/esp-solar-contoller/Arduino/esp32_solar_controller/esp32_solar_controller.ino
/*

Note I use esp32 doit dev kit v1.
but the arduino IDE settings for this board seem to cause issues.

so I configure the IDE to use:

* WEMOS LOLIN32
* Patition Scheme: Minimal SPIFFS, large app with OTA
* CPU 240Mhz (WiFi/BT)
* Flash Frequency 80Mhz

this seems to resolve OTA issues.

*/

#define FW_VERSION 406

// to longer timeout = esp weirdness
#define httpget_timeout 5000

#define OPT_DISABLE -2
#define OPT_DEFAULT -1

#define stiny 32
#define ssmall 64
#define smedium 128
#define slarge 257

#define MAX_CELLS 16


// ================================================================================================
/*
 *  Print last reset reason of ESP32
 *  =================================
 *
 *  Use either of the methods print_reset_reason
 *  or verbose_print_reset_reason to display the
 *  cause for the last reset of this device.
 *
 *  Public Domain License.
 *
 *  Author:
 *  Evandro Luis Copercini - 2017
 */

#if CONFIG_IDF_TARGET_ESP32  // ESP32/PICO-D4
#include "esp32/rom/rtc.h"
#elif CONFIG_IDF_TARGET_ESP32S2
#include "esp32s2/rom/rtc.h"
#elif CONFIG_IDF_TARGET_ESP32C2
#include "esp32c2/rom/rtc.h"
#elif CONFIG_IDF_TARGET_ESP32C3
#include "esp32c3/rom/rtc.h"
#elif CONFIG_IDF_TARGET_ESP32S3
#include "esp32s3/rom/rtc.h"
#elif CONFIG_IDF_TARGET_ESP32C6
#include "esp32c6/rom/rtc.h"
#elif CONFIG_IDF_TARGET_ESP32H2
#include "esp32h2/rom/rtc.h"
#else
#error Target CONFIG_IDF_TARGET is not supported
#endif

#define uS_TO_S_FACTOR 1000000 /* Conversion factor for micro seconds to seconds */

// ================================================================================================

// #include <Arduino.h>
#include <SD.h>

#include <WiFi.h>
#include <WiFiClient.h>
#include <WiFiAP.h> // todo remove as WiFi is configured via SD card json config
#include <WiFiUdp.h>
#include <ESPmDNS.h>

#include <HTTPClient.h>

#include <ESP32httpUpdate.h>


#include <ArduinoJson.h>
const size_t jsonsize = 1024 * 4;

#include <WebServer.h>
WebServer server(80);

// -----------------------------------------------------------------------------------------

#include <Wire.h>
#include "SSD1306Ascii.h"
#include "SSD1306AsciiWire.h"

SSD1306AsciiWire oled;

// -----------------------------------------------------------------------------------------

#include <Ads1115_mux.h>
const uint8_t pin_asel1 = 26;
const uint8_t pin_asel2 = 17;
const uint8_t pin_asel3 = 14;
const uint8_t pin_asel4 = 27;

Ads1115_mux adsmux(pin_asel1, pin_asel2, pin_asel3, pin_asel4);

// -----------------------------------------------------------------------------------------
// lm75a

// note: modify library and comment out wire.begin and wire.end

#include <M2M_LM75A.h>
M2M_LM75A lm75a(0x4f);
M2M_LM75A lm75a2(0x48); // used on micro boards

uint8_t lm75a_address = 0x4f;

float board_temp = 0;
float board_temp_min = 9999999;
float board_temp_max = 0;
float board_temp_old = 0; // only used to track changes in temp to prevent message spam.

// -----------------------------------------------------------------------------------------

#include <Mmaths.h>

Mmaths mmaths;

// -----------------------------------------------------------------------------------------

#include <TimeLib.h>

const unsigned int localPort = 2390;      // local port to listen for UDP packets

const int NTP_PACKET_SIZE = 48; // NTP time is in the first 48 bytes of message
byte packetBuffer[NTP_PACKET_SIZE]; //buffer to hold incoming & outgoing packets

WiFiUDP Udp;

// -----------------------------------------------------------------------------------------
// timers

struct SysTimers
{
  unsigned long api = 0;
  unsigned long iapi = 0;
  unsigned long api_last_update = 0;

  unsigned long mode_check = 0;
  unsigned long pgrid_last_update = 0;
  unsigned long use_fallback = 0;

  unsigned long lv_shutdown = 0;
  unsigned long hv_shutdown = 0;

  unsigned long charger_off = 0;
  unsigned long inverter_off = 0;

  unsigned long pgrid = 0;
  unsigned long adc_poll = 0;
  unsigned long lm75a_poll = 0;

  unsigned long update_check = 0;
  unsigned long ntp_sync = 0;
  unsigned long oled = 0;

  unsigned long led = 0;

  unsigned long i2c_check = 0;

  unsigned long calc_energy_usage = 0;
};

SysTimers timers;

//------------------------------------------------------------------------------
// cell voltages

double cells_volts[MAX_CELLS*3];
double cells_volts_real[MAX_CELLS*3]; // used to track real voltage when using AIN, used as temp storage for API
float cell_volt_diff = 0;
float cell_volt_high = 0;
float cell_volt_low = 0;

float pack_total_volts = 0;

// uint8_t cell_lh[2] = {0, 0};
uint8_t low_cell = 0;
uint8_t high_cell = 0;

//------------------------------------------------------------------------------

uint8_t vapi_errors = 0;

//------------------------------------------------------------------------------

const String mime_html    = "text/html";
const String mime_txt     = "text/plain";
const String mime_json    = "application/json";
const String mime_css     = "text/css";

const String http_str     = "http://";
const String denied_str   = "Denied";
const String title_str    = "title_hostn";

const String dothtml        = ".htm";
const String dottxt        = ".txt";

const String html_header          = "/header" + dothtml;
const String html_config          = "/config" + dothtml;
const String html_battery         = "/batconf" + dothtml;
const String html_calibrate       = "/batcal" + dothtml;
const String html_acinfo          = "/acinfo" + dothtml;
const String html_cpconfig        = "/cpconfig" + dothtml;
const String html_stats           = "/stats" + dothtml;
const String html_mode            = "/mode" + dothtml;
const String html_modet            = "/modet" + dothtml;
const String html_apiservers      = "/api" + dothtml;
const String html_advance_config  = "/advance" + dothtml;
const String html_footer          = "/footer" + dothtml;
const String html_js_header       = "/jsheader" + dothtml;
const String html_issue_log       = "/issue" + dothtml;
const String html_net_config      = "/network" + dothtml;
const String html_datasrcs        = "/datasrcs" + dothtml;
const String html_sys_info        = "/system" + dothtml;
const String html_battery_info    = "/battery" + dothtml;
const String html_upload_config   = "/up_conf" + dothtml;
const String html_port_config     = "/portconf" + dothtml;

