jacob-jarick/esp-solar-contoller/Arduino/esp32_solar_controller/esp32_solar_controller.ino
const String css_file             = "/style.css";
const String txt_log_system       = "/log" + dottxt;
const String txt_passwd_file      = "/passwd";
const String json_config_file     = "/config.jsn";

//------------------------------------------------------------------------------

const uint16_t size_system_msgs = 1024;
String system_msgs = "";



float phase_a_watts = 0;
float phase_b_watts = 0;
float phase_c_watts = 0;

float phase_a_voltage = 0;
float phase_b_voltage = 0;
float phase_c_voltage = 0;

float phase_a_voltage_high = 0;
float phase_b_voltage_high = 0;
float phase_c_voltage_high = 0;

float phase_a_voltage_low = 10000;
float phase_b_voltage_low = 10000;
float phase_c_voltage_low = 10000;


float energy_consumed_old = 0; // previous day
float energy_consumed = 0;

float phase_sum = 0;
float phase_sum_old = 0;

float phase_avg = 0;

String passwd = "";

uint8_t download_index = 0; // html page download index
byte system_mode = 0;

uint8_t i2cdevcount = 0; // used on startup and then for system i2c ping

const int8_t power_array_size = 10;

int get_url_code; // global url fetch code, eg 404, 401, 200

// =================================================================================================


//------------------------------------------------------------------------------

const uint8_t max_api_vservers = 3;
const uint8_t max_api_iservers = 1;

struct Sconfig
{
  uint16_t fwver = 0;

  float maxsystemtemp = 40;


  // API

  uint8_t api_vserver_count = 0;


  bool api_venable[max_api_vservers];
  char api_vserver_hostname[max_api_vservers][ssmall];

  bool api_ienable[max_api_iservers];
  char api_iserver_hostname[max_api_iservers][ssmall];

  bool api_lm75a = 0;
  bool api_grid = 0;

  float api_pollsecs = 1;

  // END of API

  char threephase_direct_url[smedium];
  char fronius_push_url[smedium];
  char pub_url[smedium];

  // sortme

  float lv_shutdown_delay; // float because we use fraction of hours eh 0.5h
  float hv_shutdown_delay;

  uint8_t charger_oot_min;
  uint8_t charger_oot_sec;

  uint8_t charger_off_min;
  uint8_t charger_off_sec;

  uint8_t inverter_oot_min;
  uint8_t inverter_oot_sec;
  byte cell_count;
  byte gmt; // divide by 2 and minus 12
  float dcvoltage_offset;
  uint8_t board_rev;

  uint8_t i2cmaxspeed;

  // wifi

  char wifi_ssid1[ssmall];
  char wifi_pass1[ssmall];
  char wifi_ssid2[ssmall];
  char wifi_pass2[ssmall];

  double battery_volt_mod[MAX_CELLS];

  char hostn[stiny];

  int8_t pin_led;
  int8_t pin_charger;
  int8_t pin_inverter;
  int8_t pin_wd;
  int8_t pin_flash;

  int8_t pin_sda;
  int8_t pin_scl;

  int8_t pin_buzzer;

  char update_host[ssmall];

  char ntp_server[ssmall];

  // battery stuff

  bool monitor_battery = 0;
  float pack_volt_min;
  float battery_volt_min;
  float battery_volt_rec;
  float battery_volt_max;

  // END battery stuff

  float cpkwh; // cost per kwh

  char description[smedium];

  // device addresses

  char oled_addr;

  // bools

  bool rotate_oled = 0;
  bool blink_led = 0;
  bool blink_led_default = 0;

  bool avg_ain = 0;

  bool threephase = 0;
  bool monitor_phase_a = 0;
  bool monitor_phase_b = 0;
  bool monitor_phase_c = 0;
  bool flip_ipin = 0;
  bool flip_cpin = 0;
  bool auto_update = 0;
  bool inv_idle_mode = 0;
  bool i_enable = 0;
  bool c_enable = 0;
  bool day_is_timer = 0;
  bool night_is_timer = 0;

  bool serial_off = 0;

  bool c_offd; // charger custom off delay
  bool c_amot; // charger idle after min on time


  bool prefer_dc = 0;

  bool hv_monitor = 1;

  uint8_t display_mode = 0;

  bool m247 = 0;

  //
  int day_watts = 0;
  int night_watts = 0;

  uint8_t c_start_h = 0;
  uint8_t c_finish_h = 0;
  uint8_t i_start_h = 0;
  uint8_t i_finish_h = 0;

  uint8_t avg_phase = 0;

  bool webc_mode = 0;
  bool led_status = 0;

  bool mcptype = 0; // 0 = MCP3021, 1 = MCP3221
  bool ads1x15type = 0; // 0 = ADS1015, 1 = ADS1115
  uint8_t muxtype = 0; // 0 = old board (2* 8-1), 1 = new boards (16-1), 2 = high precision board

  bool dumbsystem = 0; // 1 dont check fronius, turn on SSRs etc
};

Sconfig config;



//------------------------------------------------------------------------------
// FLAGS

// group system flags into 1 structure for easy naming.
struct SysFlags
{
  bool restart = 0;
  bool access_point = 0;
  bool update_self = 0;
  bool night = 0;
  bool day = 0;
  bool shutdown_lvolt = 0;
  bool shutdown_hvolt = 0;
  bool update_found = 0;

  bool save_config = 0;

  bool sdcard_read_error = 0;

  bool download_html = 0;

  bool lm75a = 0;

  bool fronius_error = 0; // Fronius 3p Fallback JSON Decode Error:

  bool adc_config_error = 0;
  bool boot_success = 0;

  bool i2c_on = 1;

  bool cells_checked = 0;

  bool ambient_temp = 0;

  bool vapi_checked = 0;

  bool c_pinmode = 0;
  bool i_pinmode = 0;
};

SysFlags flags;

// =================================================================================================

void modeset(byte m = 0, bool manual = 0, uint16_t manual_duration = 0);

void setup()
{
  const uint8_t toneinc = 45;
  uint16_t tone = 90;

  ledcAttach(16, 1000, 8);  // setup buzzer pin (need to enable before config is loaded....)

  Serial.begin(115200);

  serial_print_reset_reason();

  sd_setup(tone);

  if(!load_config())
  {
    flags.download_html = 1;
    save_config();
  }

  set_pins();

  // --------------------------------------------------------------------------------------
  // i2c Setup

  tone += toneinc; beep_helper(tone, 250);

  bool i2c_requested = 0;
  if(config.pin_sda == OPT_DISABLE || config.pin_scl == OPT_DISABLE)
  {
    Serial.println("i2c Disabled.");
  }
  else if(config.pin_scl == OPT_DEFAULT || config.pin_sda == OPT_DEFAULT)
  {
    Serial.println("i2c on default pins.");
    i2c_requested = 1;

    // disable internal pullups
    // https://arduino.stackexchange.com/questions/13448/disabling-i2c-internal-pull-up-resistors
    digitalWrite(21, LOW);
    digitalWrite(22, LOW);


    Wire.begin();
  }
  else
  {
    Serial.println("i2c on custom pins.");
    i2c_requested = 1;

