jacob-jarick/esp-solar-contoller/Arduino/esp32_solar_controller/esp32_solar_controller.ino
    digitalWrite(config.pin_scl, LOW);
    digitalWrite(config.pin_sda, LOW);

    Wire.begin(config.pin_scl, config.pin_sda);
  }

  flags.i2c_on = 1;
  if(i2c_requested)
  {
    // detect boards max speed
    uint8_t i2c_test_enum1 = 0;
    uint8_t i2c_test_enum2 = 0;

    Wire.setClock(400000L); // fast mode
    i2cdevcount = i2c_enum();

    if(i2cdevcount)
    {
      if(config.i2cmaxspeed >= 1)
      {
        Wire.setClock(1000000L); // fast mode plus
        i2c_test_enum1 = i2c_enum();
      }

      if(config.i2cmaxspeed == 2)
      {
        Wire.setClock(3400000L); // high speed mode (buggy on latest esp32 board)
        i2c_test_enum2 = i2c_enum();
      }
    }
    else
    {
      Serial.println("no i2c devices found, disabling i2c.");
      flags.i2c_on = 0;
    }

    if(flags.i2c_on)
    {
      if(i2c_test_enum1 != i2cdevcount)
      {
        log_msg("i2c speed 400000 (fast)");
        Wire.setClock(400000L);
      }
      else if(i2c_test_enum2 != i2cdevcount)
      {
        log_msg("i2c speed 1000000 (fast plus)");
        Wire.setClock(1000000L);
      }
      else
      {
        log_msg("i2c speed 3400000 (highspeed)");
      }
    }
    else
    {
      Serial.println("i2c disabled");
    }

    // setup OLED

    oled_setup();
    oled_set1X();
    oled_print("FW: ");
    oled_println(String(FW_VERSION));

    oled_clear();

    if(flags.i2c_on)
    {
      if(i2c_ping(0x4f))
      {
        lm75a_address = 0x4f;
        flags.lm75a = 1;
      }
      else if(config.board_rev == 2 && i2c_ping(0x48))
      {
        lm75a_address = 0x48;
        flags.lm75a = 1;
      }

      adsmux.mcptype = config.mcptype;
      adsmux.ads1x15type = config.ads1x15type;
      adsmux.muxtype = config.muxtype;
      adsmux.avg_ain = config.avg_ain;
      adsmux.setup();
    }
  }

  // --------------------------------------------------------------------------------------
  // System checks

  both_println(F("Trim Log"));
  file_limit_size(txt_log_system, 4096);

  both_println(F("Set Idle"));
  modeset(0);

  both_println(F("Set Led"));
  set_led(config.led_status);


  // --------------------------------------------------------------------------------------


  oled_clear();
  both_println(F("WiFI"));

  tone += toneinc; beep_helper(tone, 250);
  if (!wifi_start())
  {
    if(!ap_start())
    {
      oled_clear();
      oled_set2X();
      oled_println(F("ACCESS\nPOINT\nERROR"));

      delay(3000);
      while(1) {};
    }
    else
    {
      log_issue("AP Started");
    }
  }
  else
  {
    log_issue("Wifi Connected");
  }

  // --------------------------------------------------------------------------------------
  // Network Services

  oled_clear();
  oled_set1X();

  if(!flags.access_point)
  {
    both_println(F("UDP"));
    Udp.begin(localPort);

    setSyncProvider(getNtpTime);
    setSyncInterval(300);
  }

  // both_println(F("MDNS http add"));
  both_println(F("MDNS"));
  MDNS.begin(config.hostn);
  MDNS.addService("http", "tcp", 80);

  // --------------------------------------------------------------------------------------
  // Setup HTTP Server

  both_println(F("HTTP"));
  {
    server.on("/", stats);
    server.on("/jsonapi", jsonapi);
    server.on("/json_cells", json_cells);

    server.on("/apiservers", apiservers);

    server.on("/config", web_config);
    server.on("/result", web_config_submit);

    server.on("/modet", modet);
    server.on("/mode_set", mode_set);

    server.on("/config_raw", config_raw);
    server.on("/whatami", whatami);
    server.on("/stats", stats);

    server.on("/force_refresh", force_refresh);

    server.on("/reset", software_reset);

    server.on("/update_menu", update_menu);
    server.on("/advance", advance_config);

    server.on("/ledon", led_on);
    server.on("/ledoff", led_off);
    server.on("/ledtoggle", led_toggle);
    server.on("/ledblink", led_blink);

    server.on("/style.css", css_raw);

    server.on("/do_update", do_update_web);

    server.on("/html_update", web_html_redownload);

    server.on("/issue_log", web_issue_log);
    server.on("/issue_submit", web_issue_submit);

    server.on("/info_raw", info_raw);
    server.on("/battery_config", battery_config);

    server.on("/cpconf", web_copy_config);
    server.on("/cpconf_submit", copy_config_submit);

    server.on("/upload_config", upload_config);
    server.on("/upload_config_submit", upload_config_submit);

    server.on("/port_config", port_config);
    server.on("/port_cfg_submit", port_cfg_submit);

    server.on("/network", net_config);

    server.on("/datasrcs", datasrcs);

    server.on("/port_info", port_info);

    server.on("/i2c_scan", i2c_scan);

    server.on("/sys_info", sys_info);

    server.on("/battery_info", battery_info);

    server.on("/bms_raw_info", bms_raw_info);

    server.on("/adc_info_raw", adc_info_raw);

    server.on("/batcal", battery_calibrate);

    server.on("/ac_info", ac_info);

    server.on("/timers", timers_page);



    server.begin();
  }

  tone += toneinc; beep_helper(tone, 250);

  // --------------------------------------------------------------------------------------
  // Setup ADSMUX

  oled_clear();

  if(adsmux.adc_found)
  {
    oled_println("ADC 1st Poll");

    for(uint8_t i = 0; i < MAX_CELLS; i++)
    {
      cells_volts_real[i] = 0;
      cells_volts[i]      = 0;
    }
  }
  else
  {
    // check config, if volt monitoring enabled but no i2c dev - display alert, Force IDLE ALWAYS

    if(config.monitor_battery && !config.api_venable[0])
    {
      log_issue("monitor_battery enabled but ADC not found");
      flags.adc_config_error = 1;
    }
  }

  // --------------------------------------------------------------------------------------
  // check if FW was updated

  if(config.fwver != FW_VERSION)
  {
    log_issue("Config FW version " + String(config.fwver) + " != FW version " + String(FW_VERSION) + ". Downloading HTML.");
    flags.download_html = 1;

    config.fwver = FW_VERSION;
    save_config();
  }

