jacob-jarick/esp-solar-contoller/Arduino/esp32_solar_controller/esp32_solar_controller.ino
  log_issue("system startup OK");

  // turn off serial if set in config.

  if(config.serial_off)
  {
    Serial.println("Disabling serial printing.");
    delay(1000);
    //Serial.end();
  }
  else
  {
    Serial.println("Serial is still enabled.");
  }
}

void set_pins()
{
  uint8_t pins_asel[3] = {pin_asel1, pin_asel2, pin_asel3 };
  for(uint8_t x = 0; x < 3; x++)
  {
    pinMode(pins_asel[x], OUTPUT);
    digitalWrite(pins_asel[x], LOW);
  }

  if(config.pin_inverter != OPT_DISABLE)
  {
    pinMode(config.pin_inverter, OUTPUT);
    digitalWrite(config.pin_inverter, config.flip_ipin);
  }

  if(config.pin_charger != OPT_DISABLE)
  {
    pinMode(config.pin_charger, OUTPUT);
    digitalWrite(config.pin_charger, config.flip_cpin);
  }

  if(config.pin_led != OPT_DISABLE)
  {
    pinMode(config.pin_led, OUTPUT);
    digitalWrite(config.pin_led, LOW);
  }

  if(config.pin_wd != OPT_DISABLE)
  {
    pinMode(config.pin_wd, OUTPUT);
    digitalWrite(config.pin_wd, LOW);
  }

  if(config.pin_flash != OPT_DISABLE)
  {
    pinMode(config.pin_flash, INPUT);
  }
}

// =================================================================================================================
// Main Loop
// =================================================================================================================


bool inverter_synced = 0;

String mode_reason = "";

String old_day_reason = "idle";
String old_night_reason = "idle";

void loop()
{
  server.handleClient();

  if(check_system_triggers())
    return;

  // ----------------------------------------------------------------------

  check_system_timers();
  set_daynight();
  check_data_sources();

  if(config.dumbsystem)
  {
    return;
  }

  // ----------------------------------------------------------------------
  // ADC Error ?

  if(!config.api_venable[0] && flags.adc_config_error)
  {
    mode_reason = datetime_str(3, '/', ' ', ':') + ": Config ERROR.\nconfig requires ADC, but ADC not found.";

    modeset(0);
    return;
  }




  // ----------------------------------------------------------------------
  // waiting on API ?

  if(config.api_venable[0] && !flags.vapi_checked)
  {
    mode_reason = datetime_str(3, '/', ' ', ':') + ": waiting on first API check.";
    modeset(0);

    return;
  }


  // ----------------------------------------------------------------------
  // Waiting on ADC fist complete poll.

  if(config.monitor_battery && !flags.cells_checked)
  {
    mode_reason = datetime_str(3, '/', ' ', ':') + ": waiting on cells first check";
    modeset(0);

    return;
  }

  // ----------------------------------------------------------------------

  // check if cell volt is low and force update

  if(config.hv_monitor && config.monitor_battery && system_mode == 1 && cell_volt_high > config.battery_volt_max)
  {
    mode_reason = "cell over volt (" + String(cell_volt_high, 3) + "v). force IDLE.";
    log_msg(mode_reason);
    mode_reason = datetime_str(3, '/', ' ', ':') + ": " + mode_reason;

    modeset(0);

    return;
  }

  // check if cell volt is over and force update ?

  if(config.monitor_battery && system_mode == 2 && cell_volt_low <= config.battery_volt_min)
  {
    mode_reason = "Cell under volt (" + String(cell_volt_low, 3) + "v), force IDLE";
    mode_reason = datetime_str(3, '/', ' ', ':') + ": " + mode_reason;

    modeset(0);

    return;
  }


  // ----------------------------------------------------------------------
  // finish loop unless its time to update

  // all checks following happen after min update time.

  if (timers.mode_check > millis())
    return;

  mode_reason = datetime_str(3, '/', ' ', ':') + ": ";


  // ----------------------------------------------------------------------
  // api server issue ?


  if(config.api_venable[0] && vapi_errors >= 10)
  {
    mode_reason += ": API voltage server error.";
    modeset(0);

    return;
  }


  // ----------------------------------------------------------------------
  // environment to hot check
  if(flags.lm75a && board_temp > config.maxsystemtemp)
  {
    String msg = "System Overheat, Ambient Temp " + String(board_temp, 2) + "c, (Max " + String(config.maxsystemtemp, 1) + "c)";

    if(!flags.ambient_temp)
      log_issue(msg);

    flags.ambient_temp = 1;

    mode_reason += msg;

    modeset(0);
    return;
  }

  if(flags.ambient_temp && board_temp + 0.5 > config.maxsystemtemp)
  {
    String msg = "System Cooling Down, Ambient Temp " + String(board_temp, 2) + "c";

    if(board_temp_old != board_temp)
    {
      board_temp_old = board_temp;
      log_msg(msg);
    }
    mode_reason += msg;
    return;
  }

  // if flag set, turn off, log recovery
  if(flags.ambient_temp)
  {
    String msg = "System Overheat recover, Ambient Temp " + String(board_temp, 2) + "c";
    log_issue(msg);
    flags.ambient_temp = 0;
  }


  // ----------------------------------------------------------------------
  // update mode

  if(timeStatus() == timeNotSet)
  {
    mode_reason = "time unsynced";
    return;
  }

  // -------------------------------------------------------------------------
  // IDLE checks

  if
  (
    (!flags.day && !flags.night) || // not day or night
    (!config.i_enable && !config.c_enable) ||   // both devices disabled
    (!config.i_enable && flags.night && !flags.day) ||  // night time only and night time dev disabled
    (!config.c_enable && flags.day && !flags.night)   // day time only and day time dev disabled

  )
  {
    mode_reason += F("Idle (1)\n");
    modeset(0);
    return;
  }

  // -------------------------------------------------------------------------
  // set local flags baed on current mode

  bool finv = 0; // inverter on flag
  bool fchg = 0; // charger on flag

  if(system_mode == 2 || system_mode == 3)
    finv = 1;

  if(system_mode == 1  || system_mode == 3)
    fchg = 1;

  // -------------------------------------------------------------------------
  // Night Device

  mode_reason = datetime_str(3, '/', ' ', ':') + "\n"; // made it this far, so reason will likely be multiline.

