jacob-jarick/esp-solar-contoller/Arduino/esp32_solar_controller/esp32_solar_controller.ino
  // discharger
  if (config.i_enable && flags.night)
  {
    String new_night_reason = "";
    // LV check
    if (config.monitor_battery && flags.shutdown_lvolt)
    {
      new_night_reason += "IDLE, LV Shutdown\n";
      finv = 0;
    }
    // cooldown check
    else if(timers.inverter_off > millis())
    {
      new_night_reason += "Idle, Inverter Cooldown.\n";
      finv = 0;
    }
    // Prefer DC (enable if !lv and !cooldown
    else if (config.prefer_dc)
    {
      new_night_reason += "Prefer DC\n";
      finv = 1;
    }
    else if (phase_sum > config.night_watts)
    {
      new_night_reason += "Drain\n";
      finv = 1;
    }
    // IDLE
    else if (config.inv_idle_mode && phase_sum < 0 ) // turn off inverter
    {
      new_night_reason += "IDLE (grid " + String(phase_sum,1) + " < 0)\n";
      finv = 0;
    }
    else if (phase_sum < config.night_watts * -1 ) // turn off inverter
    {
      new_night_reason += "IDLE (grid " + String(phase_sum,1) + " < night_watts)\n";
      finv = 0;
    }
    // timer check
    else if (config.night_is_timer)
    {
      new_night_reason += "timer\n";
      finv = 1;
    }
    else if(finv) // no change, inverter still on
    {
      new_night_reason = old_night_reason;
    }
    else // no change, inverter still off
    {
      new_night_reason = "idling\n";
    }

    mode_reason += "Night: " + new_night_reason;
    old_night_reason = new_night_reason;
  }


  // -------------------------------------------------------------------------
  // Day Device

  // charger
  if (config.c_enable && flags.day)
  {
    String new_day_reason = "";

    // idle after min on time check
    if(fchg == 1 && config.c_amot) // check behaviour after being on for min on time. 1 = go to off.
    {
      new_day_reason += "idle after min on time\n";
      fchg = 0;
    }

    // charger cooldown
    else if(timers.charger_off > millis())
    {
      new_day_reason += "charger cooldown\n";
      fchg = 0;
    }

    // timer
    else if (config.day_is_timer)
    {
      new_day_reason += "Timer\n";
      fchg = 1;
    }
    // CHARGE
    else if (phase_sum < (config.day_watts * -1.0) )
    {
      new_day_reason += "Charge\n";
      fchg = 1;
    }
    // IDLE
    else if (phase_sum > 50.0)
    {
      new_day_reason += "idle\n";
      fchg = 0;
    }
    else if(fchg) // no change from prior mode and chg on
    {
      new_day_reason += old_day_reason;
      //new_day_reason += "OLD";
    }
    else // no change from prior mode and chg oFF
    {
      new_day_reason += "idling\n";
    }

    // monitoring voltage charger logic
    // all these checks disable charger if conds met
    if(config.monitor_battery && fchg)
    {
      // HV Shutdown
      if(flags.shutdown_hvolt)
      {
        new_day_reason += "Idle, HV\n";
        fchg = 0;
      }
      // Shutdown
      else if(cell_volt_high > config.battery_volt_max)
      {
        new_day_reason += "Idle, battery full\n";
        fchg = 0;
      }
    }
    mode_reason += "Day: " + new_day_reason;
    old_day_reason = new_day_reason;
  }

  // -------------------------------------------------------------------------
  // Select Mode

  uint8_t tmp_mode = 0;
  if(finv)
    tmp_mode = 2;
  if(fchg)
    tmp_mode = 1;

  if(config.prefer_dc && finv && fchg)
    tmp_mode = 3;

  // SET MODE
  modeset(tmp_mode);
}

// ======================================================================================================================

const unsigned long ap_time = 15 * 60 * 1000;

bool check_system_triggers() // returns 1 if a event was triggered
{
  // all checks should be flags

  if(flags.sdcard_read_error)
  {
    sd_setup(120);
    log_issue("SD Reconnected.");
    return 1;
  }

  if(flags.save_config)
  {
    vars_sanity_check();
    save_config();
    flags.save_config = 0;
    log_msg("Saved Config");
    return 1;
  }

  if(flags.restart)
  {
    oled_clear();
    oled_set2X();
    both_println(F("restart"));
    log_issue("Restarting, flag set");
    modeset(0);
    delay(500);
    ESP.restart();
  }

  // WiFi disconnected trigger
  if (!flags.access_point && WiFi.status() != WL_CONNECTED)
  {
    oled_clear();
    both_println(F("WiFi ERROR"));

    log_issue("Restarting, WiFi disconnected");

    modeset(0);
    flags.restart = !wifi_start(); // seems to need a restart if wifi is out here.
    return 1;
  }

  // BOOT OK trigger
  if(!flags.boot_success)
  {
    oled_clear();
    oled_set1X();
    flags.boot_success = 1;
    String tmp = "FW: " + String(FW_VERSION);
    both_println(tmp);
    log_issue(tmp);

    return 1;
  }

  // update trigger
  if(flags.update_self) // ideally we would do this via timer to allow webpage to respond....
  {
    oled_clear();
    oled_set2X();
    both_println("Self\nUpdate");

    do_update();
    return 1;
  }

  // download html trigger
  if(!flags.access_point && flags.download_html)
  {
    download_html_from_remote();
    return 1;
  }



  return 0;
}

// ======================================================================================================================

bool check_system_timers()
{
  bool result = 0;

  // all if statements should be timer based

  // Grid data source timeout trigger (time based)
  if
  (
    !config.dumbsystem &&
    !config.api_grid &&
    !flags.access_point &&
    timers.pgrid_last_update != 0 &&
    millis() - timers.pgrid_last_update > 600000 // 10 min
  )
  {
    oled_clear();
    both_print(F("CHECK\nTIMEOUT"));

    log_issue("Restarting, Grid datasource timeout");

    flags.restart = 1;
    return 1;
  }

  // API source timeout trigger (time based)
  if
    (
      !flags.access_point &&
      config.api_venable[0] &&
      timers.api_last_update != 0 &&
      millis() - timers.api_last_update > (15 * 60 * 1000)
    )
    {
      oled_clear();
      both_print(F("CHECK\nTIMEOUT"));

      String msg = "Restarting, API datasource timeout";
      Serial.println("\n\n" + msg);
      log_issue(msg);

      flags.restart = 1;
      return 1;
    }

  // AP Mode restart trigger (time based)
  if(flags.access_point && millis() > ap_time)
  {
    oled_clear();
    both_print(F("AP\nTIMEOUT"));

    log_issue("Restarting, AP Timeout");
    flags.restart = 1;
    return 1;
  }

  if((config.blink_led || config.blink_led_default) && timers.led < millis())
  {
    timers.led = millis() + 500;
    set_led(3);
  }

