jacob-jarick/esp-solar-contoller/Arduino/esp32_solar_controller/esp32_solar_controller.ino
  // OLED timer
  if(millis() > timers.oled)
  {
    if(timers.oled > 0)
      oled_print_info();

    result = 1;

    if(config.dumbsystem)
      timers.oled = millis() + 10 * 1000;
    else
      timers.oled = millis() + 1750;
  }

  if(flags.i2c_on && millis() > timers.i2c_check)
  {
    if(i2cdevcount != i2c_enum())
    {
      log_issue("i2c error. triggering restart.");

      // lower i2c speed
      if(config.i2cmaxspeed >= 1)
      {
        config.i2cmaxspeed--;
        save_config();
      }

      flags.restart = 1;
      result = 1;
    }
    timers.i2c_check = millis() + (15 * 60 * 1000);
  }

  // auto update timer
  //if(config.auto_update && millis() > timers.update_check)
  // updated to check for updates at specific hour (~7pm seems ideal for me)
  if(config.auto_update && hour() == 19 && millis() > timers.update_check)
  {
    if(timers.update_check > 0) // dont trigger on fist boot
    {
      oled_clear();
      oled_set2X();
      both_println("Auto\nUpdate");
      Serial.println(timers.update_check);

      do_update();
    }

    timers.update_check = millis() + SECS_PER_DAY * 1000; // dont check for another 24h
    result = 1;
  }

  return result;
}

// ======================================================================================================================


uint8_t adc_pcount = 0; // check data sources position count. - min poll count before running check_cells

unsigned long adc_pps_ms = millis(); // time of last complete poll
float adc_poll_time = 0;


bool check_data_sources()
{
  bool result = 0;

  // API Check

  if(config.api_ienable[0] && millis() > timers.iapi)
  {
    bool api_result = api_isync(0);

    if(api_result)
      timers.iapi = millis() + (1000 * config.api_pollsecs);
    else
      timers.iapi = millis() + (httpget_timeout * 3); // if failed, fallback to safe poll time.

    result = 1;
  }

  if(config.api_venable[0] && millis() > timers.api)
  {
    bool api_result = api_poller();

    if(api_result)
    {
      vapi_errors = 0;
      timers.api = millis() + (1000 * config.api_pollsecs);
    }
    else
    {
      vapi_errors++;
      vapi_errors = mmaths.mmin<uint8_t>(200, vapi_errors); // prevent overflow
      timers.api = millis() + (httpget_timeout * 3); // if failed, fallback to safe poll time.
    }

    result = 1;
  }


  // fronius grid check
  if(!config.dumbsystem && !config.api_grid && millis() > timers.pgrid)
  {
    check_grid();

    timers.pgrid = millis() + 1333;
    result = 1;
  }

  // ADC poll
  if(!config.api_venable[0] && config.monitor_battery && millis() > timers.adc_poll)
  {
//     log_msg("ADC Poll");
    // wait if pins have been set, go next loop immediately otherwise (dont update timer)
    bool pins_set = adsmux.adc_poll();

    if(!pins_set)
      timers.adc_poll = millis() + 10; // be reasonable, also lets mux output settle

    // if polling complete, check cells etc
    if(adsmux.polling_complete)
    {
      unsigned long tmp_ms = millis() - adc_pps_ms;
      adc_pps_ms = millis();
      adc_poll_time = tmp_ms / 1000.0;

      // wait (adsmux.ain_history_size) full polls a little for voltages to smooth.
      if(adc_pcount > adsmux.ain_history_size)
      {
        cells_update();
        check_cells();
      }
      else
      {
        adc_pcount++;
      }
    }

    result = 1;
  }

  if(!config.api_lm75a && flags.lm75a && millis() > timers.lm75a_poll)
  {
    if(lm75a_address == 0x48)
      board_temp = lm75a2.getTemperature();
    else if(lm75a_address == 0x4f)
      board_temp = lm75a.getTemperature();

    board_temp_max = mmaths.mmax<float>(board_temp_max, board_temp);
    board_temp_min = mmaths.mmin<float>(board_temp_min, board_temp);

    timers.lm75a_poll = millis() + 666;

    result = 1;
  }

  return result;
}

void check_cells()
{
  flags.cells_checked = true;

  cell_volt_low = 10000;
  cell_volt_high = 0;

//   bool lv_recon_trigger = 1; // reconnect if all cells are above battery_volt_rec
  bool lv_trigger = 0;
  bool hv_trigger = 0;

  unsigned long ms = millis();

  // single cell check
  if(config.cell_count == 1 && cells_volts_real[0] < config.pack_volt_min)
    lv_trigger = 1;

  // cell checks
  pack_total_volts = 0;
  for(byte i = 0; i < config.cell_count; i++)
  {
    pack_total_volts += cells_volts[i]; // calculate pack total.

    if(cells_volts[i] < cell_volt_low)
    {
      low_cell = i;
      cell_volt_low = cells_volts[i];
    }
    if(cells_volts[i] > cell_volt_high)
    {
      high_cell = i;
      cell_volt_high = cells_volts[i];
    }
  }

  // after loop preform trigger checks

  // HV check
  if(config.hv_monitor && cells_volts[high_cell] >= config.battery_volt_max)
  {
    hv_trigger = 1;
    timers.hv_shutdown = ms + (config.hv_shutdown_delay * 3600000.0);
  }

  // LV Check
  if(cells_volts[low_cell] <= config.battery_volt_min)
  {
    lv_trigger = 1;
    timers.lv_shutdown = ms + (config.lv_shutdown_delay * 3600000.0);
  }

  cell_volt_diff = cell_volt_high - cell_volt_low;

  String now_str = datetime_str(0, '/', ' ', ':');

  // ----------------------------------------------------------------------
  // flags.shutdown_hvolt check

  if(config.hv_monitor)
  {
    // HV recon check
    if(!hv_trigger && flags.shutdown_hvolt && millis() > timers.hv_shutdown)
    {
      flags.shutdown_hvolt = 0;

      String tmsg = "HV Reconnect.\n";
      for(uint8_t i = 0; i < config.cell_count; i++)
      {
        String tspacer = ":\t";

        if(i == high_cell) // highlight highest cell
          tspacer = ":*\t";

        tmsg += "   " + String(i+1) + tspacer + String(cells_volts[i], 3) + "\n";
      }
      log_issue(tmsg);
    }

    // ----------------------------------------------------------------------
    // HV disconnect check
    if(hv_trigger && !flags.shutdown_hvolt)
    {
      flags.shutdown_hvolt = 1;

      String tmsg = "HV Disconnect.\n";
      for(uint8_t i = 0; i < config.cell_count; i++)
      {
        String tspacer = ":\t";

