jacob-jarick/esp-solar-contoller/Arduino/esp32_solar_controller/esp32_solar_controller.ino
        if(cells_volts[i] >= config.battery_volt_max) // highlight cells over volt
          tspacer = ":*\t";

        tmsg += "   " + String(i+1) + tspacer + String(cells_volts[i], 3) + "\n";
      }
      log_issue(tmsg);
    }
  }

  // ----------------------------------------------------------------------
  // flags.shutdown_lvolt check
  if(lv_trigger && !flags.shutdown_lvolt)
  {
    flags.shutdown_lvolt = 1;

    String tmsg = "LV Shutdown.\n";
    for(uint8_t i = 0; i < config.cell_count; i++)
    {
      String tspacer = ":\t";

      if(cells_volts[i] <= config.battery_volt_min) // if below min volts, highlight with an *
        tspacer = ":*\t";

      tmsg += "   " + String(i+1) + tspacer + String(cells_volts[i], 3) + "\n";
    }

    log_issue(tmsg);
  }

  // ----------------------------------------------------------------------
  // reconnect check
  if(flags.shutdown_lvolt && cells_volts[low_cell] >= config.battery_volt_rec && millis() > timers.lv_shutdown)
  {
    flags.shutdown_lvolt = 0;

    String tmsg = "LV Reconnect.\n";
    for(uint8_t i = 0; i < config.cell_count; i++)
    {
      String tspacer = ":\t";

      if(i == low_cell) // highlight lowest cell
        tspacer = ":*\t";

      tmsg += "   " + String(i+1) + tspacer + String(cells_volts[i], 3) + "\n";
    }

    log_issue(tmsg);
  }
}

bool check_grid()
{
  if(flags.access_point)
    return 0;

  if(update_p_grid() == 0)
  {
    if(!inverter_synced)
    {
      oled_clear();
      oled_set2X();
      both_println(F("Waiting 4\nInverter"));
      both_print_ip();
    }

    Serial.print(F("x"));
    return 0;
  }

  calc_energy_usage();

  Serial.print(F("."));
  return 1;
}

// ======================================================================================================================

void set_led(const char m)
{
  if(config.pin_led == OPT_DISABLE)
    return;

  if(m == 3) // toggle without changing value of config.led_status
  {
    digitalWrite(config.pin_led, !digitalRead(config.pin_led));
    return;
  }

  config.blink_led = 0;

  if(m == 0)
    config.led_status = 0;
  else if (m == 1)
    config.led_status = 1;
  else if (m == 2) // toggle
    config.led_status = !config.led_status;

  digitalWrite(config.pin_led, config.led_status);
}

void both_print_ip()
{
  oled_set1X();
  oled_print(F("IP:   "));

  if(flags.access_point)
  {
    //oled_println(WiFi.softAPIP().toString());
    IPAddress myIP = WiFi.softAPIP();
    Serial.print("AP IP address: ");
    Serial.println(myIP);

    oled_println(String(String(myIP[0]) + "." + myIP[1] + "." + myIP[2] + "." + myIP[3]));
  }
  else
  {
    Serial.println("IP: " + WiFi.localIP().toString());
    oled_println(WiFi.localIP().toString());
  }


}

void oled_print_info()
{
  oled_clear();
  oled_set2X();

  if(flags.access_point)
  {
    both_println(F("AP Mode"));
    both_print_ip();
    both_println(F("SSID: SolarAP"));

    const unsigned long ms = millis();
    unsigned long rbtime = 0;
    if(ap_time > ms)
      rbtime = ap_time - ms;

    rbtime /= 1000;
    rbtime /= 60;
    both_println(String(F("Reboot in:\n")) + String(rbtime) + String(F(" min")));
    oled_set2X();

    return;
  }

  if(config.dumbsystem)
  {
    oled_set2X();
    oled_println(config.hostn);
    oled_println(datetime_str(2, ' ', ' ', ':'));
    oled_set1X();
    oled_println("");
    oled_println(WiFi.localIP().toString());

    return;
  }

  // if over board temp display warning.
  if(flags.lm75a && board_temp > config.maxsystemtemp)
  {
    oled_set2X();
    oled_println("TOO HOT !!");
    oled_println("\n  " + String(board_temp, 2) + "c\n" );

    oled_set1X();
    oled_println("");
    oled_println(WiFi.localIP().toString());
  }

  if(config.display_mode == 1)
  {
    oled_println("A " + String(phase_a_watts, 1) + "W");
    oled_println("B " + String(phase_b_watts, 1) + "W");
    oled_println("C " + String(phase_c_watts, 1) + "W");
    oled_set1X();
    oled_println(WiFi.localIP().toString());

    return;
  }
  if(config.display_mode == 2)
  {
    oled_println("A " + String(phase_a_voltage, 1) + "v");
    oled_println("B " + String(phase_b_voltage, 1) + "v");
    oled_println("C " + String(phase_c_voltage, 1) + "v");
    oled_set1X();
    oled_println(WiFi.localIP().toString());

    return;
  }
  if(config.display_mode == 3)
  {
    oled_println("A " + String(phase_a_watts / phase_a_voltage, 2) + "A");
    oled_println("B " + String(phase_b_watts / phase_b_voltage, 2) + "A");
    oled_println("C " + String(phase_c_watts / phase_c_voltage, 2) + "A");
    oled_set1X();
    oled_println(WiFi.localIP().toString());

    return;
  }
  if(config.display_mode == 4)
  {
    float tpsum = 0;

    tpsum = get_watts(3);

    if(tpsum >= 1000)
      oled_println("Now " + String(tpsum/1000, 2) + "kW");
    else
      oled_println("Now " + String(tpsum, 0) + "W");

    oled_println("Day " + String(energy_consumed, 1) + "kWh");

    oled_println("  $ " + String((energy_consumed) * config.cpkwh, 2) );

    oled_set1X();
    oled_println("");
    oled_println(WiFi.localIP().toString());

    return;
  }
  if(config.display_mode == 5) // adams display
  {
    oled_println("V " + String(phase_a_voltage, 2));
    oled_println("W " + String(phase_a_watts, 2));
    oled_println("A " + String(phase_a_watts / phase_a_voltage, 2));

    oled_set1X();
    oled_println("");
    oled_println(WiFi.localIP().toString());

    return;
  }
  if(config.display_mode == 6)
  {
    oled_println("V " + String(phase_b_voltage, 2));
    oled_println("W " + String(phase_b_watts, 2));
    oled_println("A " + String(phase_b_watts / phase_b_voltage, 2));

    oled_set1X();
    oled_println("");
    oled_println(WiFi.localIP().toString());

    return;
  }
  if(config.display_mode == 7)
  {
    oled_println("V " + String(phase_c_voltage, 2));
    oled_println("W " + String(phase_c_watts, 2));
    oled_println("A " + String(phase_c_watts / phase_c_voltage, 2));

    oled_set1X();
    oled_println("");
    oled_println(WiFi.localIP().toString());

    return;
  }

  // ----------------------------------------------------------------------
  // oled print info


  {
    if (system_mode == 0)
      oled_print(F("IDL "));
    else if (system_mode == 1)
      oled_print(F("CHG "));
    else if (system_mode == 2)
      oled_print(F("DRN "));
    else if (system_mode == 3)
      oled_print(F("C&D "));

    oled_println(datetime_str(2, ' ', ' ', ':'));

    oled_print(F("KWh  "));
    oled_println(String(phase_sum / 1000, 2));
  }

  if(flags.lm75a)
  {
    oled_set2X();
    oled_println(String(board_temp, 2) + "c\n" );
  }
  else
  {
    oled_set1X();
    oled_print(F("Update "));
    oled_println(next_update_string(0));

