jacob-jarick/esp-solar-contoller/Arduino/esp32_solar_controller/esp32_solar_controller.ino
  }

  // ----------------------------------------------------------------------
  // oled print system info

  oled_set1X();

  both_print_ip();

  if(config.monitor_battery)
  {
    // low_cell
    oled_print("L " + String(low_cell+1) + ": " + String(cells_volts[low_cell], 2) + " ");

    // high_cell
    oled_print("H " + String(high_cell+1) + ": " + String(cells_volts[high_cell], 2));
  }
  oled_set2X();
}

void calc_next_update()
{
  uint32_t i_sec = config.inverter_oot_sec + (config.inverter_oot_min * 60);
  uint32_t c_sec = config.charger_oot_sec + (config.charger_oot_min * 60);

  uint32_t rest_s = 30;

  if(system_mode == 0) // IDLE
  {
    rest_s = random(5, 10);
  }
  else if(system_mode == 3) // use which ever one is greater (inverter / charger)
  {
    if(i_sec < c_sec)
      rest_s = c_sec;
    else
      rest_s = i_sec;
  }
  else if(system_mode == 1) // CHARGER
  {
    rest_s = c_sec;
  }
  else if (system_mode == 2) // INVERTER
  {
    rest_s = i_sec;
  }

  timers.mode_check = millis() + (rest_s * 1000);
}

void modeset(byte m, bool manual, uint16_t manual_duration)
{
  // if swapping direct from one device to another, force a n Second idle in between
  bool idle_forced = 0;
  if( (system_mode == 1 && m == 2) || (system_mode == 2 && m == 1) )
  {
    idle_forced = 1;
    m = 0;
  }

// check prior mode - set cooldown timers
  if(m != system_mode) // we care about prior mode (system_mode) which hasnt changed yet but will.
  {
    // log mode change
    String tmp = "";
    if(m == 0)
      tmp = "Idle";
    else if(m == 1)
      tmp = "Charge";
    else if(m == 2)
      tmp = "Drain";
    else if(m == 3)
      tmp = "Both";
    else
      tmp = String(m)  + "?";

    if(manual)
      tmp += " - Manual";

    log_msg(String("modeset: ") + tmp );

    // update timers IF swapping modes from inverter on OR charger on
    if
    (
      (system_mode == 1 || system_mode == 3) && // charger is on in modes 1 & 3
      ( m != 1 && m != 3)  // swapping to a non charging mode
    ) // charger turning off
    {
      if(config.c_offd) // custom off delay set
        timers.charger_off = millis() + (config.charger_off_min * 60 * 1000) + (config.charger_off_sec * 1000);
      else
        timers.charger_off = millis() + (config.charger_oot_min * 60 * 1000) + (config.charger_oot_sec * 1000);
    }
    else if
    (
      (system_mode == 2 || system_mode == 3) && // inverter is on in modes 2 & 3
      (m != 2 && m != 3) // mode swapping to a non inverter mode
    ) // inverter turning off
    {
      timers.inverter_off = millis() + (config.inverter_oot_min * 60 * 1000) + (config.inverter_oot_sec * 1000);
    }
  }

  flags.c_pinmode = 0;
  flags.i_pinmode = 0;

  if (m == 0) // idle
  {
    flags.i_pinmode = 0;
    flags.c_pinmode = 0;
  }
  else if (m == 1)  // charge
  {
    flags.i_pinmode = 0;
    flags.c_pinmode = 1;
  }

  else if (m == 2)  // drain (inverter)
  {
    flags.i_pinmode = 1;
    flags.c_pinmode = 0;
  }
  else if (m == 3)  // BOTH SYSTEMS ON (used for prefer DC)
  {
    flags.i_pinmode = 1;
    flags.c_pinmode = 1;
  }

  else // BAD MODE !!!
  {
    while (1)
    {
      oled_clear();
      both_println("BAD MODE");
      delay(1000);
    }
  }

  bool same_mode = 0;

  if(system_mode == m)
    same_mode = 1;

  system_mode = m;

  if(manual_duration > 0)
      timers.mode_check = millis() + manual_duration * 60 * 1000;
  else if(idle_forced)
    timers.mode_check = millis() + random(1000, 5000); // 1 - 5 secs
  else if(same_mode)
    timers.mode_check = millis() + random(500, 4000); // 0.5 to x secs
  else
    calc_next_update();

  if(config.flip_cpin)
    flags.c_pinmode = !flags.c_pinmode;
  if(config.flip_ipin)
    flags.i_pinmode = !flags.i_pinmode;


  // set pin modes and return
  if(config.pin_charger != OPT_DISABLE)
    digitalWrite(config.pin_charger, flags.c_pinmode);

  if(config.pin_inverter != OPT_DISABLE)
    digitalWrite(config.pin_inverter, flags.i_pinmode);
}
